[
  {
    "id": 0,
    "question": "Have you ever disliked someone I\u0027ve dated?"
  },
  {
    "id": 1,
    "question": "Have you ever had a crush on someone I\u0027ve been with? What did you do?"
  },
  {
    "id": 2,
    "question": "Have you ever had a sex dream about me? What happened?"
  },
  {
    "id": 3,
    "question": "What\u0027s something you\u0027d want to change about me?"
  },
  {
    "id": 4,
    "question": "What did you think of me when you first met me?"
  },
  {
    "id": 5,
    "question": "Am I your cool friend, funny friend, cute friend, smart friend, or ugly friend?"
  },
  {
    "id": 6,
    "question": "What would it take for us to have sex?"
  },
  {
    "id": 7,
    "question": "Have you ever caught me masturbating or having sex? What did you do?"
  },
  {
    "id": 8,
    "question": "Who would you be most embarrased to introduce me to? Why?"
  },
  {
    "id": 9,
    "question": "If someone offered you 1 million to never talk to me again, would you take it?"
  },
  {
    "id": 10,
    "question": "How would you describe me to someone who\u0027s never met me?"
  },
  {
    "id": 11,
    "question": "Do you love me? If yes, say it or take a shot."
  },
  {
    "id": 12,
    "question": "What are some things I do to let you know I\u0027m mad without me actually saying anything?"
  },
  {
    "id": 13,
    "question": "Have I ever told you a secret that you\u0027ve gone on to tell someone else?"
  },
  {
    "id": 14,
    "question": "If I killed somebody would you help me cover up?"
  },
  {
    "id": 15,
    "question": "If we were to meet for the first time now would we still be best freinds?"
  },
  {
    "id": 16,
    "question": "If you had to eat one part of my body, what part would it be?"
  },
  {
    "id": 17,
    "question": "What\u0027s my greates asset physically?"
  },
  {
    "id": 18,
    "question": "When was the moment we became best friends?"
  },
  {
    "id": 19,
    "question": "Finish this sentence: My favorite genre of porn is..."
  },
  {
    "id": 20,
    "question": "Finish this sentence: I\u0027m most scared of..."
  },
  {
    "id": 21,
    "question": "What do we always fight about?"
  },
  {
    "id": 22,
    "question": "Describe me in 3 words."
  },
  {
    "id": 23,
    "question": "Have you ever seen me naked?"
  },
  {
    "id": 24,
    "question": "Do you wish we spent more time together?"
  },
  {
    "id": 25,
    "question": "Have you ever thought of me sexually?"
  },
  {
    "id": 26,
    "question": "Is there a secret that you have never told me?"
  },
  {
    "id": 27,
    "question": "What do you think of my relationship with my significant other?"
  },
  {
    "id": 28,
    "question": "What do you think of my family?"
  },
  {
    "id": 29,
    "question": "Where is the weirdest place you\u0027ve had sex?"
  },
  {
    "id": 30,
    "question": "Have you ever had sex in my bed?"
  }
]